# Compositor & Hyprland ecosystem
hyprland
hyprlock
hypridle
hyprpolkitagent
xdg-desktop-portal-hyprland

# Terminal & editor
kitty
neovim
zsh

# Wallpaper & screenshots
awww

# Clipboard & dmenu
cliphist
fuzzel

# Display management
nwg-displays

# Core CLI tools
wl-clipboard
brightnessctl
playerctl
grim
slurp
socat

# Audio
pipewire
pipewire-pulse
wireplumber
pavucontrol

# File management & viewers
nemo
yazi
imv
zathura
zathura-pdf-mupdf

# Networking & bluetooth
bluez
blueman
networkmanager
network-manager-applet
nm-connection-editor

# System utilities
udisks2
udiskie
polkit
power-profiles-daemon

# Theming
nwg-look
dconf

# GPU (base — needed on all machines)
mesa

# Fonts
noto-fonts
noto-fonts-emoji
ttf-font-awesome
ttf-opensans
ttf-libre-baskerville

# Portals
xdg-desktop-portal-gtk

# Shell extras
starship
zsh-autosuggestions
zsh-syntax-highlighting
zsh-completions

# Build tools
base-devel
git

# Screenshots: grimblast is in aur.txt as grimblast-git
